Documents/бит_РаспределениеОплатыПоПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_РаспределениеОплатыПоПоставщикам</Name>
			<BasedOn>
				<xr:Item>Document.бит_ОплатаКУ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийВводНачальныхОстатковПоКУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ОплатаКУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЛС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоНаЛС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонИзвещений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_СведенияПоУслугамЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияПоУслугамЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПолучателиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПолучателиДенежныхСредств</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПолучательДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/бит_РаспределениеОплатыПоПоставщикам/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбеспечениеПроведенияДокумента

// Распределение оплаты по поставщикам.
//  ЛицевыеСчета - таблица значений.
//
Процедура РаспределениеОплаты(ЛицевыеСчета)Экспорт 
	
	СтруктураСчетовЖКХ = бит_ОбщегоНазначения.ПолучитьСчетаРасчетовЖКХ(Организация,КонецМесяца(Дата));	
	СписокЛС.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЛицевыеСчета.ЛицевойСчет,
	|	ЛицевыеСчета.Услуга,
	|	ЛицевыеСчета.Сумма + ЛицевыеСчета.СуммаПени КАК Сумма,
	|	ЛицевыеСчета.ШаблонИзвещений
	|ПОМЕСТИТЬ ЛицевыеСчета
	|ИЗ
	|	&ЛицевыеСчета КАК ЛицевыеСчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛСПоставщики.ЛицевойСчет,
	|	ЛСПоставщики.Услуга,
	|	бит_ПолучателиДенежныхСредствСрезПоследних.ПолучательДенежныхСредств,
	|	ЕСТЬNULL(ЛСПоставщики.Сумма, 0) КАК Сумма,
	|	ЛСПоставщики.Поставщик,
	|	ЛСПоставщики.ШаблонИзвещений,
	|	бит_ПолучателиДенежныхСредствСрезПоследних.ДоговорКонтрагента
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет,
	|		ЛицевыеСчета.Услуга КАК Услуга,
	|		бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
	|		ЛицевыеСчета.Сумма КАК Сумма,
	|		ЛицевыеСчета.ШаблонИзвещений КАК ШаблонИзвещений
	|	ИЗ
	|		ЛицевыеСчета КАК ЛицевыеСчета
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Момент, ) КАК бит_СведенияПоУслугамЛССрезПоследних
	|			ПО ЛицевыеСчета.ЛицевойСчет = бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
	|				И ЛицевыеСчета.Услуга = бит_СведенияПоУслугамЛССрезПоследних.Услуга) КАК ЛСПоставщики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПолучателиДенежныхСредств.СрезПоследних(&Момент, ) КАК бит_ПолучателиДенежныхСредствСрезПоследних
	|		ПО ЛСПоставщики.Услуга = бит_ПолучателиДенежныхСредствСрезПоследних.Услуга
	|			И ЛСПоставщики.Поставщик = бит_ПолучателиДенежныхСредствСрезПоследних.Поставщик";
	
	Запрос.УстановитьПараметр("ЛицевыеСчета", ЛицевыеСчета);
	Запрос.УстановитьПараметр("Момент"      ,КонецМесяца(Дата));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		Если ТипЗнч(Выборка.ПолучательДенежныхСредств) = Тип("СправочникСсылка.Контрагенты") тогда  
			
			Строки = СписокЛС.Добавить();
			Строки.ЛицевойСчет     = Выборка.ЛицевойСчет;
			Строки.Поставщик       = Выборка.Поставщик;
			Строки.Услуга          = Выборка.Услуга;
			Строки.ШаблонИзвещений = Выборка.ШаблонИзвещений;
			
			Строки.СчетАбонента =  СтруктураСчетовЖКХ.СчетСторПКУ;
			СтрокаСубконта = Строки.СчетАбонента.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "ВидСубконто");
			Если Не СтрокаСубконта = Неопределено тогда
				Строки["Субконто"+СтрокаСубконта.НомерСтроки] = Выборка.ПолучательДенежныхСредств;
			КонецЕсли;
			СтрокаСубконта = Строки.СчетАбонента.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры, "ВидСубконто");
			Если Не СтрокаСубконта = Неопределено тогда
				Если ЗначениеЗаполнено(Выборка.ДоговорКонтрагента)
					И Выборка.ДоговорКонтрагента.Организация = Организация Тогда 
					Строки["Субконто"+СтрокаСубконта.НомерСтроки] = Выборка.ДоговорКонтрагента;
				КонецЕсли;
			КонецЕсли;
			
			Строки.СчетКУ = СтруктураСчетовЖКХ.СчетСторПКУОплата;
			СтрокаСубконтаКУ = Строки.СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты, "ВидСубконто");
			Если Не СтрокаСубконтаКУ = Неопределено тогда
				Строки["СубконтоКУ"+СтрокаСубконтаКУ.НомерСтроки] = Выборка.ПолучательДенежныхСредств;
			КонецЕсли;
			СтрокаСубконтаКУ = Строки.СчетКУ.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры, "ВидСубконто");
			Если Не СтрокаСубконтаКУ = Неопределено тогда
				Если ЗначениеЗаполнено(Выборка.ДоговорКонтрагента)
					И Выборка.ДоговорКонтрагента.Организация = Организация Тогда  	
					Строки["СубконтоКУ"+СтрокаСубконта.НомерСтроки] = Выборка.ДоговорКонтрагента;
				КонецЕсли;
			КонецЕсли;
			Строки.Сумма           = Выборка.Сумма;
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет наличие уже созданого документа на основании.
//
// Параметры: 
//  Отказ                   - флаг отказа в проведении.
//
Процедура ПроверитьДокументОснование(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_РаспределениеОплатыПоПоставщикам.Ссылка
	|ИЗ
	|	Документ.бит_РаспределениеОплатыПоПоставщикам КАК бит_РаспределениеОплатыПоПоставщикам
	|ГДЕ
	|	бит_РаспределениеОплатыПоПоставщикам.ДокументОснование = &ДокументОснование
	|	И бит_РаспределениеОплатыПоПоставщикам.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("ДокументОснование" ,ДокументОснование);
	Запрос.УстановитьПараметр("Ссылка"            ,Ссылка);
	Если Не Запрос.Выполнить().Пустой() тогда
		бит_ОбщегоНазначения.СообщитьОбОшибке("Введенный документ распределения уже существует.",Отказ,,СтатусСообщения.Важное);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или.
// Заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить:
	ОбязательныеРеквизитыШапки = "Организация,ДокументОснование";
	
	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры

// Выполняет движения по регистрам. 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоЛС,Отказ, Заголовок)
	
	ДатаДока = Дата;
	
	// СтруктураСчетовЖКХ - стурктура счетов жкх.
	СтруктураСчетовЖКХ = бит_ОбщегоНазначения.ПолучитьСчетаРасчетовЖКХ(СтруктураШапкиДокумента.Организация,КонецМесяца(СтруктураШапкиДокумента.Дата));
	
	Если СтруктураСчетовЖКХ.СчетДохода = Неопределено ИЛИ НЕ ЗначениеЗаполнено(СтруктураСчетовЖКХ.СчетДохода) Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не указан счет дохода в настройках параметров ЖКХ.
		|Проводки по учету выручки (вознаграждение) от поступивших денежных средств, не сформированы!!!");
		
		СчетДохода = Неопределено;
		
	Иначе
		
		СчетДохода = СтруктураСчетовЖКХ.СчетДохода;
		
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из ТаблицаПоЛС Цикл	
		Если ЗначениеЗаполнено( СтрокаТЧ.СчетАбонента) И ЗначениеЗаполнено( СтрокаТЧ.СчетКУ) Тогда  			 			
			Проводка = Движения.Хозрасчетный.Добавить();
			мСумма = СтрокаТЧ.Сумма;
			Проводка.Период     = СтруктураШапкиДокумента.Дата;
			Проводка.Содержание = "Распределение оплаты по поставщикам";
			Проводка.Организация = СтруктураШапкиДокумента.Организация;
			
			Проводка.СчетДт = СтрокаТЧ.СчетАбонента;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.Субконто1);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.Субконто2);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.Субконто3);
			Проводка.СчетКт = СтрокаТЧ.СчетКУ;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.СубконтоКУ1);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.СубконтоКУ2);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.СубконтоКУ3);	
			Проводка.Сумма = СтрокаТЧ.Сумма;
			
			Сумма = СтрокаТЧ.Сумма * СтрокаТЧ.Поставщик.КомиссионныйСбор;
			
			Если СчетДохода <> Неопределено И Сумма <> 0 Тогда
				
				Проводка = Движения.Хозрасчетный.Добавить();
				Проводка.Период     = СтруктураШапкиДокумента.Дата;
				Проводка.Содержание = "Учтена выручка (вознаграждение) от поступивших денежных средств.";
				Проводка.Организация = СтруктураШапкиДокумента.Организация;
				
				Проводка.СчетДт = СтрокаТЧ.СчетКУ;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.Субконто1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.Субконто2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.Субконто3);
				Проводка.СчетКт = СтруктураСчетовЖКХ.СчетДохода;

				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтруктураСчетовЖКХ.Субконто1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтруктураСчетовЖКХ.Субконто2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтруктураСчетовЖКХ.Субконто3);
				Проводка.Сумма = Сумма;

			КонецЕсли; 
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ)
	
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Сформируем структуру реквизитов шапки документа.
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Проверим правильность заполнения шапки документа.
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Сумма"        ,"Сумма");
	СтруктураПолей.Вставить("Поставщик"    ,"Поставщик");
	СтруктураПолей.Вставить("Услуга"       ,"Услуга");
	СтруктураПолей.Вставить("СчетАбонента" ,"СчетАбонента");
	СтруктураПолей.Вставить("Субконто1"    ,"Субконто1");
	СтруктураПолей.Вставить("Субконто2"    ,"Субконто2");
	СтруктураПолей.Вставить("Субконто3"    ,"Субконто3");
	СтруктураПолей.Вставить("СчетКУ"       ,"СчетКУ");
	СтруктураПолей.Вставить("СубконтоКУ1"  ,"СубконтоКУ1");
	СтруктураПолей.Вставить("СубконтоКУ2"  ,"СубконтоКУ2");
	СтруктураПолей.Вставить("СубконтоКУ3"  ,"СубконтоКУ3");
	
	РезультатЗапросаПоУслугам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "СписокЛС", СтруктураПолей);
	ТаблицаПоЛС          = РезультатЗапросаПоУслугам.Выгрузить();
	
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаПоЛС, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// При обмене проверок не выполняем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(ЭтотОбъект, Отказ);
	
	ПроверитьДокументОснование(Отказ);	
	СуммаДокумента = СписокЛС.Итог("Сумма");	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Основание = ДанныеЗаполнения;
	
	// На одном и том же основании должен создаваться только один документ.
	ДополнительныеСвойства.Вставить("ОтменаСозданияНовогоДокумента", Ложь);
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.бит_ОплатаКУ") Тогда
		
		ДокОсн = Документы.бит_РаспределениеОплатыПоПоставщикам.НайтиПоРеквизиту("ДокументОснование", Основание);
		
	Иначе
		
		бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
